#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
openstack_compute_instance_v2.cloud-info: Refreshing state... [id=d504888e-619a-4361-96f0-c8ee49b424f0]
openstack_compute_instance_v2.cloud-info-keycloak: Refreshing state... [id=48a01bbf-0e2a-43db-8a33-21baae1a0818]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # openstack_compute_instance_v2.cloud-info must be replaced
-/+ resource "openstack_compute_instance_v2" "cloud-info" {
      ~ access_ip_v4        = "192.168.1.108" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_name         = "svc1.m" -> (known after apply)
      ~ id                  = "d504888e-619a-4361-96f0-c8ee49b424f0" -> (known after apply)
      ~ image_name          = "ubuntu-18.04-amd64-raw" -> (known after apply)
        name                = "cloud-info"
      + region              = (known after apply)
      ~ security_groups     = [
          - "ssh - open",
            # (1 unchanged element hidden)
        ]
      - tags                = [] -> null
      ~ user_data           = "64b77588ef1bb37d044ceb9097e023644bcbc855" -> "947ba4619c5960bcea9b4a5f775938167a85a8ee" # forces replacement
        # (5 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "192.168.1.108" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:40:1a:9c" -> (known after apply)
          ~ name           = "cloud_egi_net" -> (known after apply)
          + port           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # openstack_compute_instance_v2.cloud-info-keycloak must be replaced
-/+ resource "openstack_compute_instance_v2" "cloud-info-keycloak" {
      ~ access_ip_v4        = "192.168.1.95" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_name         = "svc1.m" -> (known after apply)
      ~ id                  = "48a01bbf-0e2a-43db-8a33-21baae1a0818" -> (known after apply)
      ~ image_name          = "ubuntu-18.04-amd64-raw" -> (known after apply)
        name                = "cloud-info-keycloak"
      + region              = (known after apply)
      ~ security_groups     = [
          - "ssh - open",
            # (1 unchanged element hidden)
        ]
      - tags                = [] -> null
      ~ user_data           = "466cfc6094fdc9b52dfd4012ef6aa108550119b2" -> "f320ef6da50b672fec24ed5f4bedb4a6157dbc91" # forces replacement
        # (5 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "192.168.1.95" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:81:8e:b3" -> (known after apply)
          ~ name           = "cloud_egi_net" -> (known after apply)
          + port           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @enolfc, Action: `pull_request`*